keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_bf.h
/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN28 */
#define IFX_DMA_ACCEN20_EN28_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN28 */
#define IFX_DMA_ACCEN20_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN28 */
#define IFX_DMA_ACCEN20_EN28_OFF (28)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN29 */
#define IFX_DMA_ACCEN20_EN29_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN29 */
#define IFX_DMA_ACCEN20_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN29 */
#define IFX_DMA_ACCEN20_EN29_OFF (29)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN2 */
#define IFX_DMA_ACCEN20_EN2_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN2 */
#define IFX_DMA_ACCEN20_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN2 */
#define IFX_DMA_ACCEN20_EN2_OFF (2)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN30 */
#define IFX_DMA_ACCEN20_EN30_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN30 */
#define IFX_DMA_ACCEN20_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN30 */
#define IFX_DMA_ACCEN20_EN30_OFF (30)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN31 */
#define IFX_DMA_ACCEN20_EN31_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN31 */
#define IFX_DMA_ACCEN20_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN31 */
#define IFX_DMA_ACCEN20_EN31_OFF (31)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN3 */
#define IFX_DMA_ACCEN20_EN3_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN3 */
#define IFX_DMA_ACCEN20_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN3 */
#define IFX_DMA_ACCEN20_EN3_OFF (3)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN4 */
#define IFX_DMA_ACCEN20_EN4_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN4 */
#define IFX_DMA_ACCEN20_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN4 */
#define IFX_DMA_ACCEN20_EN4_OFF (4)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN5 */
#define IFX_DMA_ACCEN20_EN5_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN5 */
#define IFX_DMA_ACCEN20_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN5 */
#define IFX_DMA_ACCEN20_EN5_OFF (5)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN6 */
#define IFX_DMA_ACCEN20_EN6_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN6 */
#define IFX_DMA_ACCEN20_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN6 */
#define IFX_DMA_ACCEN20_EN6_OFF (6)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN7 */
#define IFX_DMA_ACCEN20_EN7_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN7 */
#define IFX_DMA_ACCEN20_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN7 */
#define IFX_DMA_ACCEN20_EN7_OFF (7)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN8 */
#define IFX_DMA_ACCEN20_EN8_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN8 */
#define IFX_DMA_ACCEN20_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN8 */
#define IFX_DMA_ACCEN20_EN8_OFF (8)

/** \\brief  Length for Ifx_DMA_ACCEN20_Bits.EN9 */
#define IFX_DMA_ACCEN20_EN9_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN20_Bits.EN9 */
#define IFX_DMA_ACCEN20_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN20_Bits.EN9 */
#define IFX_DMA_ACCEN20_EN9_OFF (9)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN0 */
#define IFX_DMA_ACCEN30_EN0_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN0 */
#define IFX_DMA_ACCEN30_EN0_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN0 */
#define IFX_DMA_ACCEN30_EN0_OFF (0)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN10 */
#define IFX_DMA_ACCEN30_EN10_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN10 */
#define IFX_DMA_ACCEN30_EN10_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN10 */
#define IFX_DMA_ACCEN30_EN10_OFF (10)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN11 */
#define IFX_DMA_ACCEN30_EN11_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN11 */
#define IFX_DMA_ACCEN30_EN11_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN11 */
#define IFX_DMA_ACCEN30_EN11_OFF (11)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN12 */
#define IFX_DMA_ACCEN30_EN12_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN12 */
#define IFX_DMA_ACCEN30_EN12_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN12 */
#define IFX_DMA_ACCEN30_EN12_OFF (12)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN13 */
#define IFX_DMA_ACCEN30_EN13_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN13 */
#define IFX_DMA_ACCEN30_EN13_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN13 */
#define IFX_DMA_ACCEN30_EN13_OFF (13)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN14 */
#define IFX_DMA_ACCEN30_EN14_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN14 */
#define IFX_DMA_ACCEN30_EN14_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN14 */
#define IFX_DMA_ACCEN30_EN14_OFF (14)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN15 */
#define IFX_DMA_ACCEN30_EN15_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN15 */
#define IFX_DMA_ACCEN30_EN15_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN15 */
#define IFX_DMA_ACCEN30_EN15_OFF (15)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN16 */
#define IFX_DMA_ACCEN30_EN16_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN16 */
#define IFX_DMA_ACCEN30_EN16_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN16 */
#define IFX_DMA_ACCEN30_EN16_OFF (16)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN17 */
#define IFX_DMA_ACCEN30_EN17_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN17 */
#define IFX_DMA_ACCEN30_EN17_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN17 */
#define IFX_DMA_ACCEN30_EN17_OFF (17)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN18 */
#define IFX_DMA_ACCEN30_EN18_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN18 */
#define IFX_DMA_ACCEN30_EN18_MSK (0x1)

