keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_bf.h
/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN18 */
#define IFX_DMA_ACCEN30_EN18_OFF (18)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN19 */
#define IFX_DMA_ACCEN30_EN19_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN19 */
#define IFX_DMA_ACCEN30_EN19_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN19 */
#define IFX_DMA_ACCEN30_EN19_OFF (19)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN1 */
#define IFX_DMA_ACCEN30_EN1_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN1 */
#define IFX_DMA_ACCEN30_EN1_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN1 */
#define IFX_DMA_ACCEN30_EN1_OFF (1)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN20 */
#define IFX_DMA_ACCEN30_EN20_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN20 */
#define IFX_DMA_ACCEN30_EN20_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN20 */
#define IFX_DMA_ACCEN30_EN20_OFF (20)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN21 */
#define IFX_DMA_ACCEN30_EN21_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN21 */
#define IFX_DMA_ACCEN30_EN21_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN21 */
#define IFX_DMA_ACCEN30_EN21_OFF (21)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN22 */
#define IFX_DMA_ACCEN30_EN22_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN22 */
#define IFX_DMA_ACCEN30_EN22_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN22 */
#define IFX_DMA_ACCEN30_EN22_OFF (22)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN23 */
#define IFX_DMA_ACCEN30_EN23_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN23 */
#define IFX_DMA_ACCEN30_EN23_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN23 */
#define IFX_DMA_ACCEN30_EN23_OFF (23)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN24 */
#define IFX_DMA_ACCEN30_EN24_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN24 */
#define IFX_DMA_ACCEN30_EN24_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN24 */
#define IFX_DMA_ACCEN30_EN24_OFF (24)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN25 */
#define IFX_DMA_ACCEN30_EN25_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN25 */
#define IFX_DMA_ACCEN30_EN25_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN25 */
#define IFX_DMA_ACCEN30_EN25_OFF (25)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN26 */
#define IFX_DMA_ACCEN30_EN26_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN26 */
#define IFX_DMA_ACCEN30_EN26_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN26 */
#define IFX_DMA_ACCEN30_EN26_OFF (26)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN27 */
#define IFX_DMA_ACCEN30_EN27_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN27 */
#define IFX_DMA_ACCEN30_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN27 */
#define IFX_DMA_ACCEN30_EN27_OFF (27)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN28 */
#define IFX_DMA_ACCEN30_EN28_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN28 */
#define IFX_DMA_ACCEN30_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN28 */
#define IFX_DMA_ACCEN30_EN28_OFF (28)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN29 */
#define IFX_DMA_ACCEN30_EN29_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN29 */
#define IFX_DMA_ACCEN30_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN29 */
#define IFX_DMA_ACCEN30_EN29_OFF (29)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN2 */
#define IFX_DMA_ACCEN30_EN2_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN2 */
#define IFX_DMA_ACCEN30_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN2 */
#define IFX_DMA_ACCEN30_EN2_OFF (2)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN30 */
#define IFX_DMA_ACCEN30_EN30_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN30 */
#define IFX_DMA_ACCEN30_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN30 */
#define IFX_DMA_ACCEN30_EN30_OFF (30)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN31 */
#define IFX_DMA_ACCEN30_EN31_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN31 */
#define IFX_DMA_ACCEN30_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN31 */
#define IFX_DMA_ACCEN30_EN31_OFF (31)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN3 */
#define IFX_DMA_ACCEN30_EN3_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN3 */
#define IFX_DMA_ACCEN30_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN3 */
#define IFX_DMA_ACCEN30_EN3_OFF (3)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN4 */
#define IFX_DMA_ACCEN30_EN4_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN4 */
#define IFX_DMA_ACCEN30_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN4 */
#define IFX_DMA_ACCEN30_EN4_OFF (4)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN5 */
#define IFX_DMA_ACCEN30_EN5_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN5 */
#define IFX_DMA_ACCEN30_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN5 */
#define IFX_DMA_ACCEN30_EN5_OFF (5)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN6 */
#define IFX_DMA_ACCEN30_EN6_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN6 */
#define IFX_DMA_ACCEN30_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN6 */
#define IFX_DMA_ACCEN30_EN6_OFF (6)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN7 */
#define IFX_DMA_ACCEN30_EN7_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN7 */
#define IFX_DMA_ACCEN30_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN7 */
#define IFX_DMA_ACCEN30_EN7_OFF (7)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN8 */
#define IFX_DMA_ACCEN30_EN8_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN8 */
#define IFX_DMA_ACCEN30_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN8 */
#define IFX_DMA_ACCEN30_EN8_OFF (8)

/** \\brief  Length for Ifx_DMA_ACCEN30_Bits.EN9 */
#define IFX_DMA_ACCEN30_EN9_LEN (1)

/** \\brief  Mask for Ifx_DMA_ACCEN30_Bits.EN9 */
#define IFX_DMA_ACCEN30_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ACCEN30_Bits.EN9 */
#define IFX_DMA_ACCEN30_EN9_OFF (9)

