keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_bf.h
/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CDER */
#define IFX_DMA_BLK_CLRE_CDER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CDER */
#define IFX_DMA_BLK_CLRE_CDER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CDER */
#define IFX_DMA_BLK_CLRE_CDER_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CDLLER */
#define IFX_DMA_BLK_CLRE_CDLLER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CDLLER */
#define IFX_DMA_BLK_CLRE_CDLLER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CDLLER */
#define IFX_DMA_BLK_CLRE_CDLLER_OFF (26)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CRAMER */
#define IFX_DMA_BLK_CLRE_CRAMER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CRAMER */
#define IFX_DMA_BLK_CLRE_CRAMER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CRAMER */
#define IFX_DMA_BLK_CLRE_CRAMER_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CSER */
#define IFX_DMA_BLK_CLRE_CSER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CSER */
#define IFX_DMA_BLK_CLRE_CSER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CSER */
#define IFX_DMA_BLK_CLRE_CSER_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CSLLER */
#define IFX_DMA_BLK_CLRE_CSLLER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CSLLER */
#define IFX_DMA_BLK_CLRE_CSLLER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CSLLER */
#define IFX_DMA_BLK_CLRE_CSLLER_OFF (25)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CSPBER */
#define IFX_DMA_BLK_CLRE_CSPBER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CSPBER */
#define IFX_DMA_BLK_CLRE_CSPBER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CSPBER */
#define IFX_DMA_BLK_CLRE_CSPBER_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_CLRE_Bits.CSRIER */
#define IFX_DMA_BLK_CLRE_CSRIER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_CLRE_Bits.CSRIER */
#define IFX_DMA_BLK_CLRE_CSRIER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CSRIER */
#define IFX_DMA_BLK_CLRE_CSRIER_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_EER_Bits.ELER */
#define IFX_DMA_BLK_EER_ELER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_EER_Bits.ELER */
#define IFX_DMA_BLK_EER_ELER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_EER_Bits.ELER */
#define IFX_DMA_BLK_EER_ELER_OFF (26)

/** \\brief  Length for Ifx_DMA_BLK_EER_Bits.ERER */
#define IFX_DMA_BLK_EER_ERER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_EER_Bits.ERER */
#define IFX_DMA_BLK_EER_ERER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_EER_Bits.ERER */
#define IFX_DMA_BLK_EER_ERER_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.DLLER */
#define IFX_DMA_BLK_ERRSR_DLLER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.DLLER */
#define IFX_DMA_BLK_ERRSR_DLLER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.DLLER */
#define IFX_DMA_BLK_ERRSR_DLLER_OFF (26)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_LEN (7)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_MSK (0x7f)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.RAMER */
#define IFX_DMA_BLK_ERRSR_RAMER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.RAMER */
#define IFX_DMA_BLK_ERRSR_RAMER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.RAMER */
#define IFX_DMA_BLK_ERRSR_RAMER_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SLLER */
#define IFX_DMA_BLK_ERRSR_SLLER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SLLER */
#define IFX_DMA_BLK_ERRSR_SLLER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SLLER */
#define IFX_DMA_BLK_ERRSR_SLLER_OFF (25)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SPBER */
#define IFX_DMA_BLK_ERRSR_SPBER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SPBER */
#define IFX_DMA_BLK_ERRSR_SPBER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SPBER */
#define IFX_DMA_BLK_ERRSR_SPBER_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.CBLD */
#define IFX_DMA_BLK_ME_ADICR_CBLD_LEN (4)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.CBLD */
#define IFX_DMA_BLK_ME_ADICR_CBLD_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.CBLD */
#define IFX_DMA_BLK_ME_ADICR_CBLD_OFF (12)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.CBLS */
#define IFX_DMA_BLK_ME_ADICR_CBLS_LEN (4)

