keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_bf.h
/** \\brief  Length for Ifx_DMA_BLK_ME_CHCR_Bits.RROAT */
#define IFX_DMA_BLK_ME_CHCR_RROAT_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHCR_Bits.RROAT */
#define IFX_DMA_BLK_ME_CHCR_RROAT_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHCR_Bits.RROAT */
#define IFX_DMA_BLK_ME_CHCR_RROAT_OFF (19)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHCR_Bits.TREL */
#define IFX_DMA_BLK_ME_CHCR_TREL_LEN (14)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHCR_Bits.TREL */
#define IFX_DMA_BLK_ME_CHCR_TREL_MSK (0x3fff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHCR_Bits.TREL */
#define IFX_DMA_BLK_ME_CHCR_TREL_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.BUFFER */
#define IFX_DMA_BLK_ME_CHSR_BUFFER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.BUFFER */
#define IFX_DMA_BLK_ME_CHSR_BUFFER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.BUFFER */
#define IFX_DMA_BLK_ME_CHSR_BUFFER_OFF (22)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.FROZEN */
#define IFX_DMA_BLK_ME_CHSR_FROZEN_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.FROZEN */
#define IFX_DMA_BLK_ME_CHSR_FROZEN_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.FROZEN */
#define IFX_DMA_BLK_ME_CHSR_FROZEN_OFF (23)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.ICH */
#define IFX_DMA_BLK_ME_CHSR_ICH_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.ICH */
#define IFX_DMA_BLK_ME_CHSR_ICH_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.ICH */
#define IFX_DMA_BLK_ME_CHSR_ICH_OFF (18)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.IPM */
#define IFX_DMA_BLK_ME_CHSR_IPM_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.IPM */
#define IFX_DMA_BLK_ME_CHSR_IPM_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.IPM */
#define IFX_DMA_BLK_ME_CHSR_IPM_OFF (19)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.LXO */
#define IFX_DMA_BLK_ME_CHSR_LXO_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.LXO */
#define IFX_DMA_BLK_ME_CHSR_LXO_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.LXO */
#define IFX_DMA_BLK_ME_CHSR_LXO_OFF (15)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.TCOUNT */
#define IFX_DMA_BLK_ME_CHSR_TCOUNT_LEN (14)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.TCOUNT */
#define IFX_DMA_BLK_ME_CHSR_TCOUNT_MSK (0x3fff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.TCOUNT */
#define IFX_DMA_BLK_ME_CHSR_TCOUNT_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.WRPD */
#define IFX_DMA_BLK_ME_CHSR_WRPD_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.WRPD */
#define IFX_DMA_BLK_ME_CHSR_WRPD_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.WRPD */
#define IFX_DMA_BLK_ME_CHSR_WRPD_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.WRPS */
#define IFX_DMA_BLK_ME_CHSR_WRPS_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.WRPS */
#define IFX_DMA_BLK_ME_CHSR_WRPS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.WRPS */
#define IFX_DMA_BLK_ME_CHSR_WRPS_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_DADR_Bits.DADR */
#define IFX_DMA_BLK_ME_DADR_DADR_LEN (32)

/** \\brief  Mask for Ifx_DMA_BLK_ME_DADR_Bits.DADR */
#define IFX_DMA_BLK_ME_DADR_DADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_DADR_Bits.DADR */
#define IFX_DMA_BLK_ME_DADR_DADR_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_R0_Bits.RD00 */
#define IFX_DMA_BLK_ME_R0_RD00_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R0_Bits.RD00 */
#define IFX_DMA_BLK_ME_R0_RD00_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R0_Bits.RD00 */
#define IFX_DMA_BLK_ME_R0_RD00_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_R0_Bits.RD01 */
#define IFX_DMA_BLK_ME_R0_RD01_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R0_Bits.RD01 */
#define IFX_DMA_BLK_ME_R0_RD01_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R0_Bits.RD01 */
#define IFX_DMA_BLK_ME_R0_RD01_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_R0_Bits.RD02 */
#define IFX_DMA_BLK_ME_R0_RD02_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R0_Bits.RD02 */
#define IFX_DMA_BLK_ME_R0_RD02_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R0_Bits.RD02 */
#define IFX_DMA_BLK_ME_R0_RD02_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_R0_Bits.RD03 */
#define IFX_DMA_BLK_ME_R0_RD03_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R0_Bits.RD03 */
#define IFX_DMA_BLK_ME_R0_RD03_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R0_Bits.RD03 */
#define IFX_DMA_BLK_ME_R0_RD03_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_R1_Bits.RD10 */
#define IFX_DMA_BLK_ME_R1_RD10_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R1_Bits.RD10 */
#define IFX_DMA_BLK_ME_R1_RD10_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R1_Bits.RD10 */
#define IFX_DMA_BLK_ME_R1_RD10_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_R1_Bits.RD11 */
#define IFX_DMA_BLK_ME_R1_RD11_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R1_Bits.RD11 */
#define IFX_DMA_BLK_ME_R1_RD11_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R1_Bits.RD11 */
#define IFX_DMA_BLK_ME_R1_RD11_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_R1_Bits.RD12 */
#define IFX_DMA_BLK_ME_R1_RD12_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R1_Bits.RD12 */
#define IFX_DMA_BLK_ME_R1_RD12_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R1_Bits.RD12 */
#define IFX_DMA_BLK_ME_R1_RD12_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_R1_Bits.RD13 */
#define IFX_DMA_BLK_ME_R1_RD13_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R1_Bits.RD13 */
#define IFX_DMA_BLK_ME_R1_RD13_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R1_Bits.RD13 */
#define IFX_DMA_BLK_ME_R1_RD13_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_R2_Bits.RD20 */
#define IFX_DMA_BLK_ME_R2_RD20_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R2_Bits.RD20 */
#define IFX_DMA_BLK_ME_R2_RD20_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R2_Bits.RD20 */
#define IFX_DMA_BLK_ME_R2_RD20_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_R2_Bits.RD21 */
#define IFX_DMA_BLK_ME_R2_RD21_LEN (8)

