keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_bf.h
/** \\brief  Mask for Ifx_DMA_BLK_ME_R2_Bits.RD21 */
#define IFX_DMA_BLK_ME_R2_RD21_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R2_Bits.RD21 */
#define IFX_DMA_BLK_ME_R2_RD21_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_R2_Bits.RD22 */
#define IFX_DMA_BLK_ME_R2_RD22_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R2_Bits.RD22 */
#define IFX_DMA_BLK_ME_R2_RD22_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R2_Bits.RD22 */
#define IFX_DMA_BLK_ME_R2_RD22_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_R2_Bits.RD23 */
#define IFX_DMA_BLK_ME_R2_RD23_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R2_Bits.RD23 */
#define IFX_DMA_BLK_ME_R2_RD23_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R2_Bits.RD23 */
#define IFX_DMA_BLK_ME_R2_RD23_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_R3_Bits.RD30 */
#define IFX_DMA_BLK_ME_R3_RD30_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R3_Bits.RD30 */
#define IFX_DMA_BLK_ME_R3_RD30_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R3_Bits.RD30 */
#define IFX_DMA_BLK_ME_R3_RD30_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_R3_Bits.RD31 */
#define IFX_DMA_BLK_ME_R3_RD31_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R3_Bits.RD31 */
#define IFX_DMA_BLK_ME_R3_RD31_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R3_Bits.RD31 */
#define IFX_DMA_BLK_ME_R3_RD31_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_R3_Bits.RD32 */
#define IFX_DMA_BLK_ME_R3_RD32_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R3_Bits.RD32 */
#define IFX_DMA_BLK_ME_R3_RD32_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R3_Bits.RD32 */
#define IFX_DMA_BLK_ME_R3_RD32_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_R3_Bits.RD33 */
#define IFX_DMA_BLK_ME_R3_RD33_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R3_Bits.RD33 */
#define IFX_DMA_BLK_ME_R3_RD33_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R3_Bits.RD33 */
#define IFX_DMA_BLK_ME_R3_RD33_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_R4_Bits.RD40 */
#define IFX_DMA_BLK_ME_R4_RD40_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R4_Bits.RD40 */
#define IFX_DMA_BLK_ME_R4_RD40_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R4_Bits.RD40 */
#define IFX_DMA_BLK_ME_R4_RD40_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_R4_Bits.RD41 */
#define IFX_DMA_BLK_ME_R4_RD41_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R4_Bits.RD41 */
#define IFX_DMA_BLK_ME_R4_RD41_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R4_Bits.RD41 */
#define IFX_DMA_BLK_ME_R4_RD41_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_R4_Bits.RD42 */
#define IFX_DMA_BLK_ME_R4_RD42_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R4_Bits.RD42 */
#define IFX_DMA_BLK_ME_R4_RD42_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R4_Bits.RD42 */
#define IFX_DMA_BLK_ME_R4_RD42_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_R4_Bits.RD43 */
#define IFX_DMA_BLK_ME_R4_RD43_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R4_Bits.RD43 */
#define IFX_DMA_BLK_ME_R4_RD43_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R4_Bits.RD43 */
#define IFX_DMA_BLK_ME_R4_RD43_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_R5_Bits.RD50 */
#define IFX_DMA_BLK_ME_R5_RD50_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R5_Bits.RD50 */
#define IFX_DMA_BLK_ME_R5_RD50_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R5_Bits.RD50 */
#define IFX_DMA_BLK_ME_R5_RD50_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_R5_Bits.RD51 */
#define IFX_DMA_BLK_ME_R5_RD51_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R5_Bits.RD51 */
#define IFX_DMA_BLK_ME_R5_RD51_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R5_Bits.RD51 */
#define IFX_DMA_BLK_ME_R5_RD51_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_R5_Bits.RD52 */
#define IFX_DMA_BLK_ME_R5_RD52_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R5_Bits.RD52 */
#define IFX_DMA_BLK_ME_R5_RD52_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R5_Bits.RD52 */
#define IFX_DMA_BLK_ME_R5_RD52_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_R5_Bits.RD53 */
#define IFX_DMA_BLK_ME_R5_RD53_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R5_Bits.RD53 */
#define IFX_DMA_BLK_ME_R5_RD53_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R5_Bits.RD53 */
#define IFX_DMA_BLK_ME_R5_RD53_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_R6_Bits.RD60 */
#define IFX_DMA_BLK_ME_R6_RD60_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R6_Bits.RD60 */
#define IFX_DMA_BLK_ME_R6_RD60_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R6_Bits.RD60 */
#define IFX_DMA_BLK_ME_R6_RD60_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_R6_Bits.RD61 */
#define IFX_DMA_BLK_ME_R6_RD61_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R6_Bits.RD61 */
#define IFX_DMA_BLK_ME_R6_RD61_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R6_Bits.RD61 */
#define IFX_DMA_BLK_ME_R6_RD61_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_R6_Bits.RD62 */
#define IFX_DMA_BLK_ME_R6_RD62_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R6_Bits.RD62 */
#define IFX_DMA_BLK_ME_R6_RD62_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R6_Bits.RD62 */
#define IFX_DMA_BLK_ME_R6_RD62_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_R6_Bits.RD63 */
#define IFX_DMA_BLK_ME_R6_RD63_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R6_Bits.RD63 */
#define IFX_DMA_BLK_ME_R6_RD63_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R6_Bits.RD63 */
#define IFX_DMA_BLK_ME_R6_RD63_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_R7_Bits.RD70 */
#define IFX_DMA_BLK_ME_R7_RD70_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R7_Bits.RD70 */
#define IFX_DMA_BLK_ME_R7_RD70_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R7_Bits.RD70 */
#define IFX_DMA_BLK_ME_R7_RD70_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_R7_Bits.RD71 */
#define IFX_DMA_BLK_ME_R7_RD71_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R7_Bits.RD71 */
#define IFX_DMA_BLK_ME_R7_RD71_MSK (0xff)

