keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_bf.h
/** \\brief  Offset for Ifx_DMA_BLK_ME_R7_Bits.RD71 */
#define IFX_DMA_BLK_ME_R7_RD71_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_R7_Bits.RD72 */
#define IFX_DMA_BLK_ME_R7_RD72_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R7_Bits.RD72 */
#define IFX_DMA_BLK_ME_R7_RD72_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R7_Bits.RD72 */
#define IFX_DMA_BLK_ME_R7_RD72_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_R7_Bits.RD73 */
#define IFX_DMA_BLK_ME_R7_RD73_LEN (8)

/** \\brief  Mask for Ifx_DMA_BLK_ME_R7_Bits.RD73 */
#define IFX_DMA_BLK_ME_R7_RD73_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_R7_Bits.RD73 */
#define IFX_DMA_BLK_ME_R7_RD73_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_RDCRC_Bits.RDCRC */
#define IFX_DMA_BLK_ME_RDCRC_RDCRC_LEN (32)

/** \\brief  Mask for Ifx_DMA_BLK_ME_RDCRC_Bits.RDCRC */
#define IFX_DMA_BLK_ME_RDCRC_RDCRC_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_RDCRC_Bits.RDCRC */
#define IFX_DMA_BLK_ME_RDCRC_RDCRC_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_SADR_Bits.SADR */
#define IFX_DMA_BLK_ME_SADR_SADR_LEN (32)

/** \\brief  Mask for Ifx_DMA_BLK_ME_SADR_Bits.SADR */
#define IFX_DMA_BLK_ME_SADR_SADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_SADR_Bits.SADR */
#define IFX_DMA_BLK_ME_SADR_SADR_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_SDCRC_Bits.SDCRC */
#define IFX_DMA_BLK_ME_SDCRC_SDCRC_LEN (32)

/** \\brief  Mask for Ifx_DMA_BLK_ME_SDCRC_Bits.SDCRC */
#define IFX_DMA_BLK_ME_SDCRC_SDCRC_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_SDCRC_Bits.SDCRC */
#define IFX_DMA_BLK_ME_SDCRC_SDCRC_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_SHADR_Bits.SHADR */
#define IFX_DMA_BLK_ME_SHADR_SHADR_LEN (32)

/** \\brief  Mask for Ifx_DMA_BLK_ME_SHADR_Bits.SHADR */
#define IFX_DMA_BLK_ME_SHADR_SHADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_SHADR_Bits.SHADR */
#define IFX_DMA_BLK_ME_SHADR_SHADR_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_SR_Bits.CH */
#define IFX_DMA_BLK_ME_SR_CH_LEN (7)

/** \\brief  Mask for Ifx_DMA_BLK_ME_SR_Bits.CH */
#define IFX_DMA_BLK_ME_SR_CH_MSK (0x7f)

/** \\brief  Offset for Ifx_DMA_BLK_ME_SR_Bits.CH */
#define IFX_DMA_BLK_ME_SR_CH_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_SR_Bits.RS */
#define IFX_DMA_BLK_ME_SR_RS_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_SR_Bits.RS */
#define IFX_DMA_BLK_ME_SR_RS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_SR_Bits.RS */
#define IFX_DMA_BLK_ME_SR_RS_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_SR_Bits.WS */
#define IFX_DMA_BLK_ME_SR_WS_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_SR_Bits.WS */
#define IFX_DMA_BLK_ME_SR_WS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_SR_Bits.WS */
#define IFX_DMA_BLK_ME_SR_WS_OFF (4)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.CBLD */
#define IFX_DMA_CH_ADICR_CBLD_LEN (4)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.CBLD */
#define IFX_DMA_CH_ADICR_CBLD_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.CBLD */
#define IFX_DMA_CH_ADICR_CBLD_OFF (12)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.CBLS */
#define IFX_DMA_CH_ADICR_CBLS_LEN (4)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.CBLS */
#define IFX_DMA_CH_ADICR_CBLS_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.CBLS */
#define IFX_DMA_CH_ADICR_CBLS_OFF (8)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.DCBE */
#define IFX_DMA_CH_ADICR_DCBE_LEN (1)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.DCBE */
#define IFX_DMA_CH_ADICR_DCBE_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.DCBE */
#define IFX_DMA_CH_ADICR_DCBE_OFF (21)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.DMF */
#define IFX_DMA_CH_ADICR_DMF_LEN (3)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.DMF */
#define IFX_DMA_CH_ADICR_DMF_MSK (0x7)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.DMF */
#define IFX_DMA_CH_ADICR_DMF_OFF (4)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.ETRL */
#define IFX_DMA_CH_ADICR_ETRL_LEN (1)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.ETRL */
#define IFX_DMA_CH_ADICR_ETRL_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.ETRL */
#define IFX_DMA_CH_ADICR_ETRL_OFF (23)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.INCD */
#define IFX_DMA_CH_ADICR_INCD_LEN (1)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.INCD */
#define IFX_DMA_CH_ADICR_INCD_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.INCD */
#define IFX_DMA_CH_ADICR_INCD_OFF (7)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.INCS */
#define IFX_DMA_CH_ADICR_INCS_LEN (1)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.INCS */
#define IFX_DMA_CH_ADICR_INCS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.INCS */
#define IFX_DMA_CH_ADICR_INCS_OFF (3)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.INTCT */
#define IFX_DMA_CH_ADICR_INTCT_LEN (2)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.INTCT */
#define IFX_DMA_CH_ADICR_INTCT_MSK (0x3)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.INTCT */
#define IFX_DMA_CH_ADICR_INTCT_OFF (26)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.IRDV */
#define IFX_DMA_CH_ADICR_IRDV_LEN (4)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.IRDV */
#define IFX_DMA_CH_ADICR_IRDV_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.IRDV */
#define IFX_DMA_CH_ADICR_IRDV_OFF (28)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.SCBE */
#define IFX_DMA_CH_ADICR_SCBE_LEN (1)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.SCBE */
#define IFX_DMA_CH_ADICR_SCBE_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.SCBE */
#define IFX_DMA_CH_ADICR_SCBE_OFF (20)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.SHCT */
#define IFX_DMA_CH_ADICR_SHCT_LEN (4)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.SHCT */
#define IFX_DMA_CH_ADICR_SHCT_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.SHCT */
#define IFX_DMA_CH_ADICR_SHCT_OFF (16)

/** \\brief  Length for Ifx_DMA_CH_ADICR_Bits.SMF */
#define IFX_DMA_CH_ADICR_SMF_LEN (3)

/** \\brief  Mask for Ifx_DMA_CH_ADICR_Bits.SMF */
#define IFX_DMA_CH_ADICR_SMF_MSK (0x7)

/** \\brief  Offset for Ifx_DMA_CH_ADICR_Bits.SMF */
#define IFX_DMA_CH_ADICR_SMF_OFF (0)

