keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_bf.h
/** \\brief  Mask for Ifx_DMA_CH_CHCSR_Bits.TCOUNT */
#define IFX_DMA_CH_CHCSR_TCOUNT_MSK (0x3fff)

/** \\brief  Offset for Ifx_DMA_CH_CHCSR_Bits.TCOUNT */
#define IFX_DMA_CH_CHCSR_TCOUNT_OFF (0)

/** \\brief  Length for Ifx_DMA_CH_CHCSR_Bits.WRPD */
#define IFX_DMA_CH_CHCSR_WRPD_LEN (1)

/** \\brief  Mask for Ifx_DMA_CH_CHCSR_Bits.WRPD */
#define IFX_DMA_CH_CHCSR_WRPD_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CH_CHCSR_Bits.WRPD */
#define IFX_DMA_CH_CHCSR_WRPD_OFF (17)

/** \\brief  Length for Ifx_DMA_CH_CHCSR_Bits.WRPS */
#define IFX_DMA_CH_CHCSR_WRPS_LEN (1)

/** \\brief  Mask for Ifx_DMA_CH_CHCSR_Bits.WRPS */
#define IFX_DMA_CH_CHCSR_WRPS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CH_CHCSR_Bits.WRPS */
#define IFX_DMA_CH_CHCSR_WRPS_OFF (16)

/** \\brief  Length for Ifx_DMA_CH_DADR_Bits.DADR */
#define IFX_DMA_CH_DADR_DADR_LEN (32)

/** \\brief  Mask for Ifx_DMA_CH_DADR_Bits.DADR */
#define IFX_DMA_CH_DADR_DADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_CH_DADR_Bits.DADR */
#define IFX_DMA_CH_DADR_DADR_OFF (0)

/** \\brief  Length for Ifx_DMA_CH_RDCRCR_Bits.RDCRC */
#define IFX_DMA_CH_RDCRCR_RDCRC_LEN (32)

/** \\brief  Mask for Ifx_DMA_CH_RDCRCR_Bits.RDCRC */
#define IFX_DMA_CH_RDCRCR_RDCRC_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_CH_RDCRCR_Bits.RDCRC */
#define IFX_DMA_CH_RDCRCR_RDCRC_OFF (0)

/** \\brief  Length for Ifx_DMA_CH_SADR_Bits.SADR */
#define IFX_DMA_CH_SADR_SADR_LEN (32)

/** \\brief  Mask for Ifx_DMA_CH_SADR_Bits.SADR */
#define IFX_DMA_CH_SADR_SADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_CH_SADR_Bits.SADR */
#define IFX_DMA_CH_SADR_SADR_OFF (0)

/** \\brief  Length for Ifx_DMA_CH_SDCRCR_Bits.SDCRC */
#define IFX_DMA_CH_SDCRCR_SDCRC_LEN (32)

/** \\brief  Mask for Ifx_DMA_CH_SDCRCR_Bits.SDCRC */
#define IFX_DMA_CH_SDCRCR_SDCRC_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_CH_SDCRCR_Bits.SDCRC */
#define IFX_DMA_CH_SDCRCR_SDCRC_OFF (0)

/** \\brief  Length for Ifx_DMA_CH_SHADR_Bits.SHADR */
#define IFX_DMA_CH_SHADR_SHADR_LEN (32)

/** \\brief  Mask for Ifx_DMA_CH_SHADR_Bits.SHADR */
#define IFX_DMA_CH_SHADR_SHADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_CH_SHADR_Bits.SHADR */
#define IFX_DMA_CH_SHADR_SHADR_OFF (0)

/** \\brief  Length for Ifx_DMA_CLC_Bits.DISR */
#define IFX_DMA_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_DMA_CLC_Bits.DISR */
#define IFX_DMA_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CLC_Bits.DISR */
#define IFX_DMA_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_DMA_CLC_Bits.DISS */
#define IFX_DMA_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_DMA_CLC_Bits.DISS */
#define IFX_DMA_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CLC_Bits.DISS */
#define IFX_DMA_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_DMA_CLC_Bits.EDIS */
#define IFX_DMA_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_DMA_CLC_Bits.EDIS */
#define IFX_DMA_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_CLC_Bits.EDIS */
#define IFX_DMA_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_DMA_ERRINTR_Bits.SIT */
#define IFX_DMA_ERRINTR_SIT_LEN (1)

/** \\brief  Mask for Ifx_DMA_ERRINTR_Bits.SIT */
#define IFX_DMA_ERRINTR_SIT_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_ERRINTR_Bits.SIT */
#define IFX_DMA_ERRINTR_SIT_OFF (0)

/** \\brief  Length for Ifx_DMA_HRR_Bits.HRP */
#define IFX_DMA_HRR_HRP_LEN (2)

/** \\brief  Mask for Ifx_DMA_HRR_Bits.HRP */
#define IFX_DMA_HRR_HRP_MSK (0x3)

/** \\brief  Offset for Ifx_DMA_HRR_Bits.HRP */
#define IFX_DMA_HRR_HRP_OFF (0)

/** \\brief  Length for Ifx_DMA_ID_Bits.MOD_REV */
#define IFX_DMA_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_DMA_ID_Bits.MOD_REV */
#define IFX_DMA_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_ID_Bits.MOD_REV */
#define IFX_DMA_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_DMA_ID_Bits.MOD_TYPE */
#define IFX_DMA_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_DMA_ID_Bits.MOD_TYPE */
#define IFX_DMA_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_ID_Bits.MOD_TYPE */
#define IFX_DMA_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_DMA_ID_Bits.MODNUMBER */
#define IFX_DMA_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_DMA_ID_Bits.MODNUMBER */
#define IFX_DMA_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_DMA_ID_Bits.MODNUMBER */
#define IFX_DMA_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_DMA_MEMCON_Bits.DATAERR */
#define IFX_DMA_MEMCON_DATAERR_LEN (1)

/** \\brief  Mask for Ifx_DMA_MEMCON_Bits.DATAERR */
#define IFX_DMA_MEMCON_DATAERR_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MEMCON_Bits.DATAERR */
#define IFX_DMA_MEMCON_DATAERR_OFF (6)

/** \\brief  Length for Ifx_DMA_MEMCON_Bits.ERRDIS */
#define IFX_DMA_MEMCON_ERRDIS_LEN (1)

/** \\brief  Mask for Ifx_DMA_MEMCON_Bits.ERRDIS */
#define IFX_DMA_MEMCON_ERRDIS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MEMCON_Bits.ERRDIS */
#define IFX_DMA_MEMCON_ERRDIS_OFF (9)

/** \\brief  Length for Ifx_DMA_MEMCON_Bits.INTERR */
#define IFX_DMA_MEMCON_INTERR_LEN (1)

/** \\brief  Mask for Ifx_DMA_MEMCON_Bits.INTERR */
#define IFX_DMA_MEMCON_INTERR_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MEMCON_Bits.INTERR */
#define IFX_DMA_MEMCON_INTERR_OFF (2)

/** \\brief  Length for Ifx_DMA_MEMCON_Bits.PMIC */
#define IFX_DMA_MEMCON_PMIC_LEN (1)

/** \\brief  Mask for Ifx_DMA_MEMCON_Bits.PMIC */
#define IFX_DMA_MEMCON_PMIC_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MEMCON_Bits.PMIC */
#define IFX_DMA_MEMCON_PMIC_OFF (8)

/** \\brief  Length for Ifx_DMA_MEMCON_Bits.RMWERR */
#define IFX_DMA_MEMCON_RMWERR_LEN (1)

/** \\brief  Mask for Ifx_DMA_MEMCON_Bits.RMWERR */
#define IFX_DMA_MEMCON_RMWERR_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MEMCON_Bits.RMWERR */
#define IFX_DMA_MEMCON_RMWERR_OFF (4)

/** \\brief  Length for Ifx_DMA_MODE_Bits.MODE */
#define IFX_DMA_MODE_MODE_LEN (1)

/** \\brief  Mask for Ifx_DMA_MODE_Bits.MODE */
#define IFX_DMA_MODE_MODE_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MODE_Bits.MODE */
#define IFX_DMA_MODE_MODE_OFF (0)

